log/stress/01-siege-remote-hypnotoad.sh.log
** SIEGE 4.0.9
** Preparing 1 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		         563 hits
Availability:		      100.00 %
Elapsed time:		        9.05 secs
Data transferred:	        0.00 MB
Response time:		        0.02 secs
Transaction rate:	       62.21 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		        1.00
Successful transactions:         563
Failed transactions:	           0
Longest transaction:	        0.03
Shortest transaction:	        0.01
 
** SIEGE 4.0.9
** Preparing 2 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        1204 hits
Availability:		      100.00 %
Elapsed time:		        9.98 secs
Data transferred:	        0.00 MB
Response time:		        0.02 secs
Transaction rate:	      120.64 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		        1.99
Successful transactions:        1204
Failed transactions:	           0
Longest transaction:	        0.04
Shortest transaction:	        0.01
 
** SIEGE 4.0.9
** Preparing 16 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        4145 hits
Availability:		      100.00 %
Elapsed time:		        9.98 secs
Data transferred:	        0.00 MB
Response time:		        0.04 secs
Transaction rate:	      415.33 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		       15.95
Successful transactions:        4145
Failed transactions:	           0
Longest transaction:	        0.21
Shortest transaction:	        0.02
 
** SIEGE 4.0.9
** Preparing 255 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        4250 hits
Availability:		      100.00 %
Elapsed time:		        9.99 secs
Data transferred:	        0.00 MB
Response time:		        0.57 secs
Transaction rate:	      425.43 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		      240.83
Successful transactions:        4250
Failed transactions:	           0
Longest transaction:	        3.20
Shortest transaction:	        0.02