log/stress/01-siege-remote.sh.log
** SIEGE 4.0.9
** Preparing 1 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		         631 hits
Availability:		      100.00 %
Elapsed time:		        9.83 secs
Data transferred:	        0.00 MB
Response time:		        0.02 secs
Transaction rate:	       64.19 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		        0.99
Successful transactions:         631
Failed transactions:	           0
Longest transaction:	        0.02
Shortest transaction:	        0.01
 
** SIEGE 4.0.9
** Preparing 2 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        1187 hits
Availability:		      100.00 %
Elapsed time:		        9.99 secs
Data transferred:	        0.00 MB
Response time:		        0.02 secs
Transaction rate:	      118.82 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		        1.99
Successful transactions:        1187
Failed transactions:	           0
Longest transaction:	        0.03
Shortest transaction:	        0.01
 
** SIEGE 4.0.9
** Preparing 16 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        4206 hits
Availability:		      100.00 %
Elapsed time:		        9.99 secs
Data transferred:	        0.00 MB
Response time:		        0.04 secs
Transaction rate:	      421.02 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		       15.93
Successful transactions:        4206
Failed transactions:	           0
Longest transaction:	        0.14
Shortest transaction:	        0.02
 
** SIEGE 4.0.9
** Preparing 255 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        4184 hits
Availability:		      100.00 %
Elapsed time:		        9.98 secs
Data transferred:	        0.00 MB
Response time:		        0.58 secs
Transaction rate:	      419.24 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		      241.11
Successful transactions:        4184
Failed transactions:	           0
Longest transaction:	        2.76
Shortest transaction:	        0.02