log/stress/01-siege.sh.log
** SIEGE 4.0.9
** Preparing 1 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		         720 hits
Availability:		      100.00 %
Elapsed time:		        9.26 secs
Data transferred:	        0.00 MB
Response time:		        0.01 secs
Transaction rate:	       77.75 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		        1.00
Successful transactions:         720
Failed transactions:	           0
Longest transaction:	        0.03
Shortest transaction:	        0.01
 
** SIEGE 4.0.9
** Preparing 2 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        1433 hits
Availability:		      100.00 %
Elapsed time:		        9.98 secs
Data transferred:	        0.00 MB
Response time:		        0.01 secs
Transaction rate:	      143.59 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		        2.00
Successful transactions:        1433
Failed transactions:	           0
Longest transaction:	        0.03
Shortest transaction:	        0.01
 
** SIEGE 4.0.9
** Preparing 16 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        5214 hits
Availability:		      100.00 %
Elapsed time:		        9.99 secs
Data transferred:	        0.00 MB
Response time:		        0.03 secs
Transaction rate:	      521.92 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		       15.93
Successful transactions:        5214
Failed transactions:	           0
Longest transaction:	        0.31
Shortest transaction:	        0.01
 
** SIEGE 4.0.9
** Preparing 255 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        5227 hits
Availability:		      100.00 %
Elapsed time:		        9.98 secs
Data transferred:	        0.00 MB
Response time:		        0.46 secs
Transaction rate:	      523.75 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		      241.59
Successful transactions:        5227
Failed transactions:	           0
Longest transaction:	        2.43
Shortest transaction:	        0.02