log/stress/01-siege.sh.log
** SIEGE 4.0.9
** Preparing 1 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		         733 hits
Availability:		      100.00 %
Elapsed time:		        9.41 secs
Data transferred:	        0.00 MB
Response time:		        0.01 secs
Transaction rate:	       77.90 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		        0.99
Successful transactions:         733
Failed transactions:	           0
Longest transaction:	        0.02
Shortest transaction:	        0.01
 
** SIEGE 4.0.9
** Preparing 2 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        1437 hits
Availability:		      100.00 %
Elapsed time:		        9.99 secs
Data transferred:	        0.00 MB
Response time:		        0.01 secs
Transaction rate:	      143.84 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		        1.99
Successful transactions:        1437
Failed transactions:	           0
Longest transaction:	        0.03
Shortest transaction:	        0.01
 
** SIEGE 4.0.9
** Preparing 16 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        5276 hits
Availability:		      100.00 %
Elapsed time:		        9.99 secs
Data transferred:	        0.00 MB
Response time:		        0.03 secs
Transaction rate:	      528.13 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		       15.92
Successful transactions:        5276
Failed transactions:	           0
Longest transaction:	        0.12
Shortest transaction:	        0.01
 
** SIEGE 4.0.9
** Preparing 255 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        5371 hits
Availability:		      100.00 %
Elapsed time:		        9.98 secs
Data transferred:	        0.00 MB
Response time:		        0.45 secs
Transaction rate:	      538.18 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		      242.88
Successful transactions:        5371
Failed transactions:	           0
Longest transaction:	        2.16
Shortest transaction:	        0.02